{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "model_type": "qwen2",
  "num_hidden_layers": 36,
  "hidden_size": 2048,
  "intermediate_size": 11008,
  "num_attention_heads": 16,
  "num_key_value_heads": 2,
  "vocab_size": 151936,
  "max_position_embeddings": 32768,
  "rms_norm_eps": 9.999999974752427e-07,
  "rope_theta": 1000000.0
}
